---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltDiameter
source: html/d0a0b451-d870-8d05-80b1-3028ec73126f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltDiameter Property

"Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemBoltDiameter { get; }
```